zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxLmu_regdef.h
/** \brief LMU object */
typedef volatile struct _Ifx_LMU
{
       Ifx_LMU_CLC                         CLC;                    /**< \brief 0, LMU Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_LMU_MODID                       MODID;                  /**< \brief 8, LMU Module ID Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_LMU_ACCEN0                      ACCEN0;                 /**< \brief 10, LMU Access Enable Register 0*/
       Ifx_LMU_ACCEN1                      ACCEN1;                 /**< \brief 14, LMU Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_18[8];         /**< \brief 18, \internal Reserved */
       Ifx_LMU_MEMCON                      MEMCON;                 /**< \brief 20, LMU Memory Control Register*/
       Ifx_LMU_SCTRL                       SCTRL;                  /**< \brief 24, LMU Safety Control Register*/
       Ifx_UReg_8Bit                       reserved_28[40];        /**< \brief 28, \internal Reserved */
       Ifx_LMU_RGN                         RGN[16];                /**< \brief 50, LMU Region Write Access Enable Register B*/
       Ifx_UReg_8Bit                       reserved_150[8];        /**< \brief 150, \internal Reserved */
       Ifx_LMU_RGNACCEN                    RGNACCEN[16];           /**< \brief 158, */
       Ifx_UReg_8Bit                       reserved_258[64936];    /**< \brief 258, \internal Reserved */
} Ifx_LMU;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXLMU_REGDEF_H */
